Tekla.Structures.RemotingHelper.GenericDelegateProxy`2
Generic delegate proxy class
Interface class type
Delegate class type

Tekla.Structures.RemotingHelper.GenericDelegateProxy`2.#ctor(System.String,Tekla.Structures.RemotingHelper.GenericDelegateProxy{`0,`1}.WrapDelegate,System.Boolean)
Constructor for GenericDelegateProxy
channelName: Name of the remoting pipe
wrapDelegate: Delegate for creating a wrapper
WeAreUnitTesting: Flag for unit testing

Tekla.Structures.RemotingHelper.GenericDelegateProxy`2.Delegate
Gets the CDelegate instance